app/controllers/products_controller.rb

INSERT INTO `products` (`code`, `name`, `description`, `image`, `category_id`, `created_at`, `updated_at`) VALUES (1000, 'Blusa Manga Bufante', 'Blusa Manga Bufante Tamanho Único.', 'foto', 1, '2019-10-27 03:00:45.438357', '2019-10-27 03:00:45.438357')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save